spec/rails_test_app/app/controllers/spaceman_spiffs_controller.rb

SELECT * FROM "spaceman_spiffs"
---
  def index
    if feature_active?(:listing)
      @spaceman_spiffs = SpacemanSpiff.all

SELECT * FROM "spaceman_spiffs" WHERE ("spaceman_spiffs"."id" = 1)
---
  def show
    @spaceman_spiff = SpacemanSpiff.find(params[:id])

INSERT INTO "spaceman_spiffs" ("name", "created_at", "updated_at") VALUES('Calvin', '2011-12-07 23:46:15', '2011-12-07 23:46:15')
---
  def create
    @spaceman_spiff = SpacemanSpiff.new(params[:spaceman_spiff])

    respond_to do |format|
      if @spaceman_spiff.save