spec/rails_app/app/controllers/spaceman_spiffs_controller.rb

  def index
    if feature_active?(:listing)
      @spaceman_spiffs = SpacemanSpiff.all
---
SELECT * FROM "spaceman_spiffs"

  def show
    @spaceman_spiff = SpacemanSpiff.find(params[:id])
---
SELECT * FROM "spaceman_spiffs" WHERE ("spaceman_spiffs"."id" = 980190962)

  def edit
    @spaceman_spiff = SpacemanSpiff.find(params[:id])
---
SELECT * FROM "spaceman_spiffs" WHERE ("spaceman_spiffs"."id" = 980190962)

  def create
    @spaceman_spiff = SpacemanSpiff.new(params[:spaceman_spiff])

    respond_to do |format|
      if @spaceman_spiff.save
---
INSERT INTO "spaceman_spiffs" ("name", "created_at", "updated_at") VALUES(NULL, '2011-12-08 00:02:05', '2011-12-08 00:02:05')

  def update
    @spaceman_spiff = SpacemanSpiff.find(params[:id])
---
SELECT * FROM "spaceman_spiffs" WHERE ("spaceman_spiffs"."id" = 980190962)

  def destroy
    @spaceman_spiff = SpacemanSpiff.find(params[:id])
    @spaceman_spiff.destroy
---
SELECT * FROM "spaceman_spiffs" WHERE ("spaceman_spiffs"."id" = 980190962)
DELETE FROM "spaceman_spiffs" WHERE "id" = 980190962